{"meta":{"title":"威胁情报与溯源分析","subtitle":null,"description":"威胁情报与溯源分析技术分享站点","author":"John Doe","url":"http://yoursite.com"},"pages":[{"title":"关于本站","date":"2017-07-03T02:26:43.000Z","updated":"2017-07-03T08:08:42.000Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"威胁情报与溯源分析是当前信息安全领域最为火热的研究点之一，然而相关的技术的分享在互联网上并不多见，仅有的一些资料都过于分散。 所以，我们希望在这里建立一个威胁情报与溯源分析相关技术的分享平台。在这里，我们提供入门指引，分享最新资讯，我们也紧跟技术前沿，解读学术论文。 当然，我们也正在学习与研究当中。希望大家加入我们，一起交流，一起分享，一起建设这个平台。 交流群：邮箱：ti@sec-wiki.com"},{"title":"projects","date":"2017-07-03T02:29:02.000Z","updated":"2017-07-03T07:05:23.000Z","comments":false,"path":"projects/index.html","permalink":"http://yoursite.com/projects/index.html","excerpt":"","text":""},{"title":"companies","date":"2017-07-03T07:10:37.000Z","updated":"2017-07-03T07:13:13.000Z","comments":false,"path":"companies/index.html","permalink":"http://yoursite.com/companies/index.html","excerpt":"","text":""},{"title":"papers","date":"2017-07-03T02:29:02.000Z","updated":"2017-07-03T07:58:24.000Z","comments":false,"path":"papers/index.html","permalink":"http://yoursite.com/papers/index.html","excerpt":"","text":""}],"posts":[{"title":"Talos--威胁情报的王者","slug":"Talos--威胁情报的王者","date":"2017-07-30T07:48:00.000Z","updated":"2017-07-30T08:01:02.414Z","comments":true,"path":"2017/07/30/Talos--威胁情报的王者/","link":"","permalink":"http://yoursite.com/2017/07/30/Talos--威胁情报的王者/","excerpt":"情报，对于现实社会犯罪活动的打击至关重要。而威胁情报，则是网络虚拟空间对付网络犯罪和网络威胁的核心“抓手”之一。","text":"情报，对于现实社会犯罪活动的打击至关重要。而威胁情报，则是网络虚拟空间对付网络犯罪和网络威胁的核心“抓手”之一。 2015年，一个名叫AnglerEK的网络犯罪钓鱼攻击恶意程序，横行全球网络，以每天9万用户的攻击速度，绑架用户电脑，向用户收取赎金，每年不法收入近6000万美元。当人们茫然无措的时候，思科内部的一个神秘团队开始出手。他们密切分析了Angler EK，发现其使用漏洞利用工具的代理服务器主要地址，深度分析到该地址的系统中的工具包操作之后，思科通过更新其网络产品重定向链接，实现对攻击行为的封锁，直接保护了50%以上的消费者免受感染。同时思科与执法部门合作，提供收集到的犯罪线索，帮助有效打击犯罪分子。 只此一役，便让这个名叫“Talos”的神秘团队，在业界浮出水面，声名鹊起。在去年的思科网络安全报告中，它更是准确地预测了今年刚肆虐全球的勒索病毒相关特征与传播趋势。这个名为“Talos”的安全团队，已经成为负责维护思科生态系统内所有安全数据的情报团队。它每天阻止200亿次威胁和8000万次恶意DNS查询，接收160亿网站请求 Talos一天的安全分析量 什么是Talos？ 思科Talos由一流的威胁研究人员组成，借助思科的复杂高端系统支撑，通过分析恶意软件、漏洞、入侵行为，以及最新趋势，提供已知和未知的威胁信息，并将其对威胁情况的理解融入到思科的所有安全产品中。简而言之，思科Talos的使命是基于智能大数据分析技术，为用户提供最为全面，最为实时的威胁防御。 Talos拥有超过250名研究人员和600名软件工程师，堪称网络安全行业最大的安全研究团队之一，其中不乏业界知名的网络安全大牛。Snort、ClamAV等开源工具和平台就是他们所写。其主要分为五个骨干团队：威胁情报、检测研究、引擎开发、漏洞研发以及外延服务。 思科Talos团队的工作是处理大量的原始数据，从中提炼有价值和准确的威胁情报。然后将这些情报传送给检测研究团队，由后者转换为检测规则。这些规则会被引擎开发团队中的软件工程师用于开发安全产品中的检测恶意软件及攻击威胁的引擎。 而漏洞研发团队的主要工作是研究零日攻击，并与一些流行软件厂商合作，抢在网络犯罪分子之前，快速解决因漏洞带来的风险。 最后是Talos的外延团队，它的主要工作是分享其了解的总体网络威胁情况，把信息整理归纳并传递给外界，类似某些机构的通报中心。而且，任何客户只要购买了任何一款思科的安全产品，都可以免费获得思科Talos的威胁情报信息 以今年5月份全球爆发的勒索病毒WannaCry为例： 3月14日，微软安全公告发布SMB漏洞补丁(MS17-010) 同一天，Talos发布Snort签名防御MS17-010漏洞 4月14日，影子经纪人发布永恒之蓝与双子星漏洞利用 4月25日，Talos发布Snort签名防御双子星和匿名共享 5月12日，WannaCry开始出现大规模传播趋势 当日上午7:30，思科Talos博客宣布发现WannaCry攻击 7:43，在全球将 kill switch 域推送到新的可见域类别 9:33，首次得到样本60分钟内，AMP在终端、电子邮件、Web 网关以及网络安全产品中实现成功检测和阻止 10:12，思科将其添加到勒索软件类别 Talos的威胁情报能力在安全牛之前发布的文章中曾写道，“思科Talos采用自动化安全大数据方法分析来自全球的邮件、网站和超过1亿5千万网络终端设备的威胁情报。每天分析全球1/3的邮件总量（6千亿封邮件/每天），每天分析超过150万独立恶意软件样本，每天收集大约160亿网站的请求。举一个形象的例子，Google 每天搜索量大约为35亿次，思科Talos收集分析的量是这个数字的4.5倍。” 之后，思科Talos与跨国电信运营商 Level 3 以及其他互联网供应商合作，使用黑洞法屏蔽了全球网络上所有 SSHPsychos 流量。对 SHPsychos 的反击成为该年度对黑客进行追缉的最大行动之一。由于其在阻止网络犯罪方面的贡献，Talos在网络安全这个圈子里备受称赞。 除了250名全职威胁情报研究人员以外，思科在全球还部署了上百万个遥测代理、1100个威胁追捕程序，拥有4个全球数据中心和超过100家威胁情报合作伙伴。根据ESG去年发布的调查报告，在全球18家网络安全威胁情报最佳提供商中，思科位列第一： 1.Cisco 2.IBM Security 3.Microsoft 4.Symantec(including Blue Coat) 5.McAfee 6.AWS 7.Dell SecureWorks 8.Check Point 9.Kaspersky 10.Palo Alto Networks 11.RSA Security 12.FireEye 13.Forcepoint 14.Fortinet 15.Imperva 16.Trend Micro Proofpoint Sophos (Source: ESG Research Survey, October 2016) Talos威胁情报细分 强大的终端遥测今年另一次大规模的恶意软件爆发，是Nyetya勒索软件。在病毒传播早期，由于监测到该活动影响的范围较广，Talos启动了称为TaCERS（Talos 重要事件响应系统）的内部研究和响应流程。TaCERS 将活动分为情报、遥测分析、反向工程、通信和检测研究，世界各地的Talos 研究人员和工程师共同应对此威胁。 根据终端遥测的结果，明确了名为“M.E.Doc”的乌克兰会计软件数据包便是攻击活动的中心源，Nyetya正是通过所有M.E.Doc更新系统的安装实现传播。M.E.Doc 是由乌克兰一家名为 Intellect Service 的公司创建的会计数据包，它部署广泛，被用于与乌克兰税务系统进行交互。 思科Talos主动直接联系到这家会计公司并建议提供援助，会计公司非常乐意的接受援助，并向前来调查的分析人员提供了日志文件和代码的使用权限。事件响应小组结合情报分析、逆向工程升级和遥测分析，确认了以下重要信息： 攻击者窃取了 M.E.Doc 管理员的证书，得以登录服务器获得根权限，并修改了 NGINX Web 服务器的配置文件，导致访问 upd.me-doc.com.ua 的任何流量将通过更新服务器代理以及关联到 IP 为 176.31.182.167 的 OVH IP 空间内的主机。 通过服务器上初次和最后的上游错误信息与现场终端遥测信息进行比较，Talos确定了攻击活动主动感染阶段的开始和结束时间，之后又确定了Nyetya的传播机制。 当 M.E.Doc 设备执行初始样本时，命令行参数与在终端遥测所观察到数据完美匹配。 思科致力于为人们带来更加安全的高智能、高性能IT设备和产品。而以Talos团队威胁情报分析为核心的前沿技术，则成为思科网络安全产品发展的路径和趋势：构建以威胁防御为中心的安全集成架构。这种安全模式将覆盖整个攻击过程，减少各种各样的产品以及互相脱节的解决方案所造成的安全复杂性。 原文来自安全牛，侵权立删http://www.aqniu.com/tools-tech/26940.html","categories":[],"tags":[]},{"title":"威胁情报资源整合——awesome-threat-intelligence","slug":"威胁情报资源整合","date":"2017-07-23T07:48:00.000Z","updated":"2017-07-23T09:47:19.995Z","comments":true,"path":"2017/07/23/威胁情报资源整合/","link":"","permalink":"http://yoursite.com/2017/07/23/威胁情报资源整合/","excerpt":"awesome-threat-intelligence是一个托管在github上的开源项目，收集各种与威胁情报相关的资源。","text":"awesome-threat-intelligence是一个托管在github上的开源项目，收集各种与威胁情报相关的资源。整个项目分为5个部分： SourcesSources部分收集了各种开源的威胁情报数据提供者，包括Alexa Top 1 Million sites,C&amp;C Tracker,Cymon,Hail a TAXII等。提供了IP、域名、DNS、URL，甚至结构化后的STIX、OpenIOC等等数据，并且很多数据源还在持续更新。但是这些开源威胁情报都显得纬度比较单一，难以构建攻击链。 FormatsFormats介绍了威胁情报的共享标准，在众多标准中，STIX已经成为了大家比较认可的事实标准。 Frameworks and PlatformsFrameworks and Platforms介绍了用于创建、收集、分析、分享威胁情报的各种框架。如比较知名的AlienVault的OTX，开源的MISP等。框架只是骨骼，还需要数据输送血液。很多框架都支持导入开源威胁情报数据，也就是第一部分提到的那些情报提供者。当然，开源情报的关联性较差，导入框架后还不能发挥它们关联分析的威力，所以使用自己创建或者使用partner分享的威胁情报是个更好的选择。 ToolsTools介绍了一些小工具，包括一些ioc的编辑器:IOC Editor、ioc_writer，TAXII协议的python封装，大名鼎鼎的Cuckoo Sandbox等。。 Research, Standards &amp; Books最后一部分是一些关于威胁情报的论文，和APT攻击的whitepapers。","categories":[{"name":"projects","slug":"projects","permalink":"http://yoursite.com/categories/projects/"}],"tags":[]},{"title":"paper_test","slug":"a","date":"2017-07-02T03:16:14.000Z","updated":"2017-07-03T12:01:14.000Z","comments":true,"path":"2017/07/02/a/","link":"","permalink":"http://yoursite.com/2017/07/02/a/","excerpt":"","text":"","categories":[{"name":"papers","slug":"papers","permalink":"http://yoursite.com/categories/papers/"}],"tags":[]},{"title":"company_test","slug":"sss","date":"2017-07-02T03:16:14.000Z","updated":"2017-07-03T12:01:42.000Z","comments":true,"path":"2017/07/02/sss/","link":"","permalink":"http://yoursite.com/2017/07/02/sss/","excerpt":"","text":"","categories":[{"name":"companies","slug":"companies","permalink":"http://yoursite.com/categories/companies/"}],"tags":[]},{"title":"Who Ran Leakedsource.com?","slug":"who-ran-leakedsource-com","date":"2017-02-18T03:16:14.000Z","updated":"2017-07-06T09:45:54.000Z","comments":true,"path":"2017/02/18/who-ran-leakedsource-com/","link":"","permalink":"http://yoursite.com/2017/02/18/who-ran-leakedsource-com/","excerpt":"Late last month, multiple news outlets reported that unspecified law enforcement officials had seized the servers for Leakedsource.com, perhaps the largest online collection of usernames and passwords leaked or stolen in some of the worst data breaches — including billions of credentials for accounts at top sites like LinkedIn and Myspace.","text":"Late last month, multiple news outlets reported that unspecified law enforcement officials had seized the servers for Leakedsource.com, perhaps the largest online collection of usernames and passwords leaked or stolen in some of the worst data breaches — including billions of credentials for accounts at top sites like LinkedIn and Myspace. In a development that could turn out to be deeply ironic, it seems that the real-life identity of LeakedSource’s principal owner may have been exposed by many of the same stolen databases he’s been peddling. The now-defunct LeakedSource service. LeakedSource in October 2015 began selling access to passwords stolen in high-profile breaches. Enter any email address on the site’s search page and it would tell you if it had a password corresponding to that address. However, users had to select a payment plan before viewing any passwords. LeakedSource was a curiosity to many, and for some journalists a potential source of news about new breaches. But unlike services such as BreachAlarm and HaveIBeenPwned.com — which force users to verify that they can access a given account or inbox before the site displays whether it has found a password associated with the account in question — LeakedSource did nothing to validate users. This fact, critics charged, showed that the proprietors of LeakedSource were purely interested in making money and helping others pillage accounts. I also was curious about LeakedSource, but for a different reason. I wanted to chase down something I’d heard from multiple sources: That one of the administrators of LeakedSource also was the admin of abusewith[dot]us, a site unabashedly dedicated to helping people hack email and online gaming accounts. Abusewith[dot]us began in September 2013 as a forum for learning and teaching how to hack accounts at Runescape, a massively multiplayer online role-playing game (MMORPG) set in a medieval fantasy realm where players battle for kingdoms and riches. The currency with which Runescape players buy and sell weapons, potions and other in-game items are virtual gold coins, and many of Abusewith[dot]us’s early members traded in a handful of commodities: Phishing kits and exploits that could be used to steal Runescape usernames and passwords from fellow players; virtual gold plundered from hacked accounts; and databases from hacked forums and Web sites related to Runescape and other online games. The administrator of Abusewith[dot]us is a hacker who uses the nickname “Xerx3s.” The avatar attached to Xerx3s’s account suggests the name is taken from Xerxes the Great, a Persian king who lived during the fifth century BC. Xerx3s the hacker appears to be especially good at breaking into discussion forums and accounts dedicated to Runescape and online gaming. Xerx3s also is a major seller of Runescape gold — often sold to other players at steep discounts and presumably harvested from hacked accounts. Xerx3s’s administrator account profile at Abusewith.us. I didn’t start looking into who might be responsible for LeakedSource until July 2016, when I sought an interview by reaching out to the email listed on the site (leakedsourceonline@gmail.com). Soon after, I received a Jabber chat invite from the address “leakedsource@chatme.im.” The entirety of that brief interview is archived here. I wanted to know whether the proprietors of the service believed they were doing anything wrong (we’ll explore more about the legal aspects of LeakedSource’s offerings later in this piece). Also, I wanted to learn whether the rumors of LeakedSource arising out of Abusewith[us] were true. “After many of the big breaches of 2015, we noticed a common public trend…’Where can I search it to see if I was affected?’,” wrote the anonymous person hiding behind the leakedsource@chatme.im account. “And thus, the idea was born to fill that need, not rising out of anything. We are however going to terminate the interview as it does seem to be more of a witch hunt instead of journalism. Thank you for your time.” Nearly two weeks after that chat with the LeakedSource administrator, I got a note from a source who keeps fairly close tabs on the major players in the English-speaking cybercrime underground. My source told me he’d recently chatted with Xerx3s using the Jabber address Xerx3s has long used prior to the creation of LeakedSource — xerx3s@chatme.im. Xerx3s told my source in great detail about my conversation with the Leakedsource administrator, suggesting that either Xerx3s was the same person I spoke with in my brief interview with LeakedSource, or that the LeakedSource admin had shared a transcript of our chat with Xerx3s. Although his username on Abusewith[dot]us was Xerx3s, many of Xerx3s’s closest associates on the forum referred to him as “Wade” in their forum postings. This is in reference to a pseudonym Xerx3s frequently used, “Jeremy Wade.” An associate of Xerx3s tells another abusewith[dot]us user that Xerx3s is the owner of LeakedSource. That comment was later deleted from the discussion thread pictured here. One email address this Jeremy Wade identity used pseudonymously was imjeremywade@gmail.com. According to a “reverse WHOIS” record search ordered through Domaintools.com, that email address is tied to two domain names registered in 2015: abusing[dot]rs, and cyberpay[dot]info. The original registration records for each site included the name “Secure Gaming LLC.” [Full disclosure: Domaintools is an advertiser on this blog].The “Jeremy Wade” pseudonym shows up in a number of hacked forum databases that were posted to both Abusewith[dot]us and LeakedSource, including several other sites related to hacking and password abuse. For example, the user database stolen and leaked from the DDoS-for-hire service “panic-stresser[dot]xyz” shows that a PayPal account tied to the email address eadeh_andrew@yahoo.com paid $5 to cover a subscription for a user named “jeremywade;” The leaked Panicstresser database shows the Jeremywade account was tied to the email address xdavros@gmail.com, and that the account was created in July 2012. The leaked Panicstresser database also showed that the first login for that Jeremywade account came from the Internet address 68.41.238.208, which is a dynamic Internet address assigned to residential customers of Comcast Communications in Michigan. According to a large number of forum postings, it appears that whoever used the xdavros@gmail.com address also created several variations on that address, including alexdavros@gmail.com, davrosalex3@yahoo.com, davrosalex4@yahoo.com, as well as themarketsales@gmail.com. The Gmail account xdavros@gmail.com was used to register at least four domain names almost six years ago in 2011. Two of those domains — daily-streaming.com and tiny-chats.com — were originally registered to a “Nick Davros” at 3757 Dunes Parkway, Muskegon, Mich. The other two were registered to a Nick or Alex Davros at 868 W. Hile Rd., Muskegon, Mich. All four domain registration records included the phone number +12313430295. I took that 68.41.238.208 Internet address that the leaked Panicstresser database said was tied to the account xdavros@gmail.com and ran an Internet search on it. The address turned up in yet another compromised hacker forum database — this time in the leaked user database for sinister[dot]ly, ironically another site where users frequently post databases plundered from other sites and forums. The leaked sinister[dot]ly forum database shows that a user by the name of “Jwade” who registered under the email address trpkisaiah@gmailcom first logged into the forum from the same Comcast Internet address tied to the xdavros@gmail.com account at Panicstresser. I also checked that Michigan Comcast address with Farsight Security, a security firm which runs a paid service that tracks the historic linkages between Internet addresses and domain names. Farsight reported that between 2012 and 2014, the Internet address 68.41.238.208 was tied to no-ip.biz, popular “dynamic IP” service. No-ip.biz and other dynamic IP address services are usually free services that allow users to have Web sites hosted on servers that frequently change their Internet addresses. This type of service is useful for people who want to host a Web site on a home-based Internet address that may change from time to time, because services like No-ip.biz can be used to easily map the domain name to the user’s new Internet address whenever it happens to change. Unfortunately, these dynamic IP providers are extremely popular in the attacker community, because they allow bad guys to keep their malware and scam sites up even when researchers manage to track the attacking IP address and convince the ISP responsible for that address to disconnect the malefactor. In such cases, dynamic IP services allow the owner of the attacking domain to simply re-route the attack site to another Internet address that he controls. Farsight reports that the address 68.41.238.208 maps back to three different dynamic IP domains, including “jwade69.no-ip.biz,” “wadewon.no-ip.biz,” and “jrat6969.zapto.org.” That first dynamic address — jwade69.no-ip.biz — was included among several hundred others in a list published by the Federal Bureau of Investigation as tied to the distribution of Blackshades, a popular malware strain that was used as a password-stealing trojan by hundreds of paying customers prior to May 2014. XERX3S HACKED?In January 2017, when news of the alleged raid on LeakedSource began circulating in the media, I began going through my notes and emails searching for key accounts known to be tied to Xerx3s and the administrator of Abusewith[dot]us. Somehow, in the previous three months I’d managed to overlook an anonymous message I received in mid-September from a reader who claimed to have hacked the email account themarketsales@gmail.com, one of several addresses my research suggested was tied to Xerx3s. The anonymous source didn’t say exactly how he hacked this account, but judging from the passwords tied to Xerx3s’s other known accounts that were included in the various forum database leaks listed above it may well have been because Xerx3s in some cases re-used the same password across multiple accounts. My anonymous source shared almost a dozen screenshots of his access to themarketsales@gmail.com, which indicate the name attached to the account was “Alex Davros.” The screenshots also show this user received thousands of dollars in Paypal payments from Leakedsource.com over a fairly short period in 2015. The screenshots also showed that themarketsales@gmail.com was tied to a PayPal account assigned to a Secured Gaming LLC. Recall that this is the same company name included in the Web site registration records back in 2011 for daily-streaming.com and tiny-chats.com. A screenshot shared with me in Sept. 2016 by an anonymous source who said he’d hacked the Gmail address “themarketsales@gmail.com”. In addition, the screenshot above and others shared by my source indicate that the same Paypal account tied to themarketsales@gmail.com was habitually used to pay a monthly bill from Hyperfilter.com, a company that provides DDoS protection and hosting and which has long been the provider used by Abusewith[dot]us. Finally, the anonymous hacker shared screenshots suggesting he had also hacked into the email account desiparker18@gmail.com, an account apparently connected to a young lady in Michigan named Desi Parker. The screenshots for Ms. Parker suggest her hacked Gmail account was tied to an Apple iTunes account billed to a MasterCard ending in 7055 and issued to an Alexander Davros at 868 W. Hile, Muskegon, Mich. The screenshots show the desiparker18@gmail.com address is associated with an Instagram account for a woman by the same name from Muskegon, Mich. (note that the address given in the WHOIS records for Alex Davros’s daily-streaming.com and tiny-chats.com also was Muskegon, Mich). Desi Parker’s Instagram lists her “spouse” as Alex Davros, and says her phone number is 231-343-0295. Recall that this is the same phone number included in the Alex Davros domain registration records for daily-streaming.com and tiny-chats.com. That phone number is currently not in service. Desi Parker’s Facebook account indeed says she is currently in a relationship with Alexander Marcus Davros, and the page links to this Facebook account for Alex Davros. Alex’s Facebook profile is fairly sparse (at least the public version of it), but there is a singular notation in his entire profile that stands out: Beneath the “Other Names” heading under the “Details about Alexander” tab, Alex lists “TheKing.” Parker’s Instagram account includes a photo of an illustration she made including her beau’s first name with a crown on top. Interestingly, two email addresses connected to domains associated with the Jeremy Wade alias — matt96sk@yahoo.com and skythekiddy@yahoo.com — are tied to Facebook accounts for Michigan residents who both list Alex Davros among their Facebook friends. Below is a rough mind map I created which attempts to show the connections between the various aliases, email addresses, phone numbers and Internet addresses mentioned above. At a minimum, they strongly indicate that Xerx3s is indeed an administrator of LeakedSource. I managed to reach Davros through Twitter, and asked him to follow me so that we could exchange direct messages. Within maybe 60 seconds of my sending that tweet, Davros followed me on Twitter and politely requested via direct message that I remove my public Twitter messages asking him to follow me. After I did as requested, Davros’s only response initially was, “Wow, impressive but I can honestly tell you I am not behind the service.” However, when pressed to be more specific, he admitted to being Xerx3s but claimed he had no involvement in LeakedSource. “I am xer yes but LS no,” Davros said. He stopped answering my questions after that, saying he was busy “doing a couple things IRL.” IRL is Internet slang for “in real life.” Presumably these other things he was doing while I was firing off more questions had nothing to do with activities like deleting profiles or contacting an attorney. Even if Davros is telling the truth, the preponderance of clues here and the myriad connections between them suggest that he at least has close ties to some of those who are involved in running LeakedSource. A “mind map” I created to illustrate the apparent relationships between various addresses and pseudonyms referenced in this story. THE LEGALITY OF LEAKEDSOURCEOn the surface, the rationale that LeakedSource’s proprietors have used to justify their service may seem somewhat reasonable: The service merely catalogs information that is already stolen from companies and that has been leaked in some form online. But legal experts I spoke with saw things differently, saying LeakedSource’s owners could face criminal charges if prosecutors could show LeakedSource intended for the passwords that are for sale on the site to be used in the furtherance of a crime. Orin Kerr, director of the Cybersecurity Law Initiative at The George Washington University, said trafficking in passwords is clearly a crime under the Computer Fraud and Abuse Act (CFAA). Specifically, Section A6 of the CFAA, which makes it a crime to “knowingly and with intent to defraud traffic in any password or similar information through which a computer may be accessed without authorization, if…such trafficking affects interstate or foreign commerce.” “CFAA quite clearly punishes password trafficking,” Kerr said. “The statute says the [accused] must be trafficking in passwords knowingly and with intent to defraud, or trying to further unauthorized access.” Judith Germano, a senior fellow at the Center on Law and Security at New York University’s School of Law, said LeakedSource might have a veneer of legitimacy if it made an effort to check whether users already have access to the accounts for which they’re seeking passwords. “If they’re not properly verifying that when the user goes to the site to get passwords then I think that’s where their mask of credibility falls,” Germano said. LeakedSource may be culpable also because at one point the site offered to crack hashed or encrypted passwords for a fee. In addition, it seems clear that the people who ran the service also advocated the use of stolen passwords for financial gain. source linkhttps://krebsonsecurity.com/2017/02/who-ran-leakedsource-com/ 中文翻译http://www.freebuf.com/articles/web/127544.html","categories":[],"tags":[]}]}